{
  "Acute Otitis Media": "An ear infection common in children, causing ear pain, fever, and sometimes fluid drainage.",
  "Alzheimer's Disease": "A progressive brain disorder that affects memory, thinking, and behavior, mostly in older adults.",
  "Anemia (adult)": "A condition where the body has fewer red blood cells or low hemoglobin, causing tiredness and weakness.",
  "Anemia (nutritional)": "A lack of healthy red blood cells caused by insufficient nutrients like iron, folic acid, or vitamin B12.",
  "Appendicitis": "Inflammation of the appendix, often causing severe abdominal pain, nausea, and fever.",
  "Asthma": "A long-term condition where the airways become inflamed and narrow, making breathing difficult.",
  "Bacterial Meningitis (pediatric)": "A severe infection of the protective membranes around the brain and spinal cord in children.",
  "Bronchiolitis (RSV)": "A viral lung infection in infants and young children that causes coughing, wheezing, and breathing problems.",
  "COPD": "Chronic obstructive pulmonary disease, a group of lung conditions including emphysema and chronic bronchitis.",
  "COPD/Chronic Bronchitis": "A long-term lung condition where airways are inflamed and produce excess mucus, causing cough and breathlessness.",
  "COVID-19": "A viral respiratory illness caused by the coronavirus, leading to fever, cough, and breathing problems.",
  "Cancer (various)": "A group of diseases where abnormal cells grow uncontrollably and may spread to other parts of the body.",
  "Cataract/Macular Degeneration": "Eye conditions that affect vision in older adults, causing blurred or loss of central vision.",
  "Chickenpox": "A contagious viral infection causing itchy skin rashes and blisters, common in children.",
  "Childhood Leukemia": "A type of blood cancer in children that affects white blood cells, causing fatigue, fever, and infections.",
  "Chronic Kidney Disease": "A long-term condition where the kidneys gradually lose their ability to filter waste from the blood.",
  "Chronic Kidney Disease (elder)": "Kidney damage that develops over time in older adults, leading to poor waste removal from the body.",
  "Common Cold": "A viral infection of the nose and throat, causing runny nose, cough, and sore throat.",
  "Conjunctivitis": "Also called pink eye, an inflammation of the eye’s outer layer causing redness, itching, and discharge.",
  "Coronary Artery Disease": "A condition where blood vessels supplying the heart become narrow, causing chest pain or heart attacks.",
  "Dengue": "A mosquito-borne viral infection causing high fever, rash, severe headache, and joint pain.",
  "Depression (elderly)": "A mental health condition in older adults that leads to persistent sadness, low energy, and loss of interest.",
  "Depression/Anxiety": "A common mental health problem that causes persistent sadness, worry, and difficulty managing daily life.",
  "Diabetes": "A condition where blood sugar levels are too high due to problems with insulin production or use.",
  "Fracture (hip/vertebrae)": "Broken bones in the hip or spine, common in older adults due to falls or weak bones.",
  "Gastritis/Peptic Ulcer": "Stomach lining irritation or sores in the digestive tract, causing pain, nausea, or bloating.",
  "Gastroenteritis": "An infection of the stomach and intestines causing diarrhea, vomiting, and stomach cramps.",
  "Gastroenteritis (elder)": "A stomach and intestine infection in older adults, leading to dehydration, diarrhea, and weakness.",
  "Hand-Foot-and-Mouth Disease": "A viral illness in children causing sores in the mouth and rashes on the hands and feet.",
  "Hearing Impairment (age-related)": "Gradual loss of hearing with age, making it harder to follow conversations.",
  "Heart_Failure": "A condition where the heart cannot pump blood effectively, leading to fatigue, breathlessness, and swelling.",
  "Hepatitis (viral/chronic)": "Liver inflammation caused by viral infection or long-term damage, leading to jaundice and liver problems.",
  "Hypertension": "High blood pressure, often without symptoms, but increases the risk of heart disease and stroke.",
  "Impetigo/Cellulitis (skin)": "Skin infections that cause red, swollen, or blistered patches, often seen in children.",
  "Ischemic Heart Disease": "Narrowing of the heart’s blood vessels that reduces oxygen supply, causing chest pain or heart attack.",
  "Liver Disease (chronic/hepatic)": "Long-term liver problems such as cirrhosis or hepatitis, leading to fatigue and jaundice.",
  "Malaria (pediatric)": "A mosquito-borne infection in children causing fever, chills, sweating, and anemia.",
  "Measles": "A highly contagious viral illness causing fever, cough, and a spreading red rash.",
  "Neonatal Sepsis": "A severe infection in newborns affecting the blood, often life-threatening without quick treatment.",
  "Osteoarthritis": "A degenerative joint disease where cartilage wears down, leading to joint pain and stiffness.",
  "Osteoporosis": "A condition where bones become weak and fragile, increasing the risk of fractures.",
  "Palliative/Multi-morbidity": "A stage of care focusing on improving quality of life for patients with multiple serious illnesses.",
  "Parkinson's Disease": "A brain disorder that affects movement, causing tremors, stiffness, and slow movements.",
  "Pediatric Tuberculosis": "A bacterial infection in children that usually affects the lungs, causing cough and weight loss.",
  "Pertussis": "Also called whooping cough, a contagious infection causing severe coughing fits.",
  "Pneumonia": "A lung infection where air sacs fill with fluid, causing cough, fever, and difficulty breathing.",
  "Pneumonia (adult)": "A lung infection in adults that leads to chest pain, fever, and shortness of breath.",
  "Pneumonia (elder)": "A serious lung infection in older adults, often leading to weakness, fever, and breathing issues.",
  "Pressure_Ulcer/Decubitus": "Also called bedsores, skin injuries caused by prolonged pressure, common in bedridden patients.",
  "Rotavirus Infection": "A common cause of diarrhea and vomiting in infants and young children.",
  "STI (Gonorrhea/Chlamydia)": "Sexually transmitted infections that cause genital pain, discharge, and if untreated, infertility.",
  "Skin Infection (Cellulitis)": "A bacterial infection of the skin that causes redness, swelling, and pain.",
  "Stroke (CVA)": "A condition where blood supply to the brain is interrupted, causing sudden weakness, confusion, or paralysis.",
  "Tuberculosis (adult)": "A bacterial infection that mainly affects the lungs, causing cough, fever, and weight loss.",
  "Typhoid": "A bacterial infection spread through contaminated food or water, causing fever, stomach pain, and weakness.",
  "UTI": "Urinary tract infection that causes burning during urination, urgency, and lower abdominal pain.",
  "UTI (elder)": "A urinary infection in older adults, sometimes showing confusion, fever, or urinary problems.",
  "UTI (pediatric)": "A urinary infection in children, causing fever, irritability, and pain while urinating."
}